backend/load-tests/artillery-load-test.yml
# ============================================================================
# LOAD TESTING CONFIGURATION - BGE v6.0.0 (SEMANA 30 - Fase 30.2)
# ============================================================================
# Propósito: Pruebas de carga realistas simulando 1000 usuarios concurrentes
# Endpoints: AI Tutor, Estudiantes, Calificaciones, Notificaciones
# Duración: 10 minutos de prueba sostenida + ramp-up de 2 minutos
# ============================================================================

config:
  # Configuración general del test
  target: "{{ $processEnvironment.TARGET_URL || 'http://localhost:3000' }}"
  phases:
    # Fase 1: Ramp-up (2 minutos) - Aumento gradual a 1000 usuarios
    - duration: 120
      arrivalRate: 10  # 10 usuarios/seg = 600 usuarios/min = 1200 en 2 min (cercano a objetivo)
      rampTo: 10
      name: "Ramp-up Phase"

    # Fase 2: Sostenido (10 minutos) - Mantener carga constante
    - duration: 600
      arrivalRate: 10
      name: "Sustained Load"

    # Fase 3: Ramp-down (2 minutos) - Reducción gradual
    - duration: 120
      arrivalRate: 10
      rampTo: 0
      name: "Ramp-down Phase"

  # Configuración de conexiones y timeouts
  http:
    timeout: 10
    max: 500  # Máximo de conexiones simultáneas (reducido para estabilidad)

  # Métricas y reportes
  metrics:
    newHistogram:
      - name: latency
        bins: [0, 100, 200, 300, 400, 500, 1000, 2000, 5000, 10000]

  # Variables para requests
  variables:
    baseUrl: "/api"  # Literal API path (sin interpolación de env vars)
    authToken: ""    # Token de autenticación (vacío para tests públicos)
    studentId: "{{ $randomNumber(1, 100) }}"
    gradeId: "{{ $randomNumber(1, 50) }}"
    tutorSessionId: "{{ $randomString(8) }}"

# ============================================================================
# ESCENARIOS DE PRUEBA - Endpoints Críticos BGE
# ============================================================================

scenarios:
  # ESCENARIO 1: AI TUTOR SERVICE (25% del tráfico)
  - name: "AI Tutor Conversations"
    weight: 25
    flow:
      # GET: Obtener perfil de aprendizaje del usuario
      - get:
          url: "{{ baseUrl }}/tutor/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
              timeout: 5000
          capture:
            json: "$.profile_id"
            as: "profileId"

      # POST: Procesar conversación con IA Tutor
      - post:
          url: "{{ baseUrl }}/tutor/conversation"
          json:
            message: "¿Cómo calculo la derivada de una función polinomial?"
            subject: "Matemáticas"
            proficiency_level: "intermedio"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
              timeout: 8000
          capture:
            json: "$.response"
            as: "tutorResponse"

      # PUT: Actualizar perfil de aprendizaje
      - put:
          url: "{{ baseUrl }}/tutor/profile"
          json:
            learning_style: "visual"
            difficulty_preference: "intermedio"
            xp_level: 5
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
              timeout: 4000

  # ESCENARIO 2: ESTUDIANTES API (20% del tráfico)
  - name: "Students Management"
    weight: 20
    flow:
      # GET: Listar estudiantes con paginación
      - get:
          url: "{{ baseUrl }}/students?page=1&limit=50&status=activo"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
              timeout: 5000
          capture:
            json: "$.data[0].id"
            as: "studentId"

      # GET: Obtener detalles de un estudiante específico
      - get:
          url: "{{ baseUrl }}/students/{{ studentId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
              timeout: 4000

      # POST: Crear reporte académico
      - post:
          url: "{{ baseUrl }}/students/{{ studentId }}/reports"
          json:
            report_type: "academic_summary"
            quarter: "Q1"
            year: 2025
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 201
              timeout: 6000

  # ESCENARIO 3: CALIFICACIONES API (20% del tráfico)
  - name: "Grades and Assessments"
    weight: 20
    flow:
      # GET: Obtener calificaciones de un estudiante
      - get:
          url: "{{ baseUrl }}/grades?student_id={{ studentId }}&semester=1"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
              timeout: 4000
          capture:
            json: "$.grades[0].id"
            as: "gradeId"

      # GET: Análisis de rendimiento
      - get:
          url: "{{ baseUrl }}/grades/{{ studentId }}/analytics"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
              timeout: 5000

      # POST: Registrar nueva calificación
      - post:
          url: "{{ baseUrl }}/grades"
          json:
            student_id: "{{ studentId }}"
            subject: "Matemáticas"
            grade: 8.5
            weight: 0.5
            semester: 1
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 201
              timeout: 4000

  # ESCENARIO 4: NOTIFICACIONES (15% del tráfico)
  - name: "Notifications System"
    weight: 15
    flow:
      # GET: Obtener notificaciones del usuario
      - get:
          url: "{{ baseUrl }}/notifications?user_id={{ studentId }}&unread=true"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
              timeout: 3000
          capture:
            json: "$.notifications[0].id"
            as: "notificationId"

      # PUT: Marcar notificación como leída
      - put:
          url: "{{ baseUrl }}/notifications/{{ notificationId }}"
          json:
            status: "read"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 200
              timeout: 2000

      # DELETE: Eliminar notificación antigua
      - delete:
          url: "{{ baseUrl }}/notifications/{{ notificationId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          expect:
            - statusCode: 204
              timeout: 2000

  # ESCENARIO 5: HEALTH CHECK (20% del tráfico - endpoints públicos)
  - name: "Health and Status Checks"
    weight: 20
    flow:
      # GET: Health endpoint (sin autenticación)
      - get:
          url: "{{ baseUrl }}/health"
          expect:
            - statusCode: 200
              timeout: 2000

      # GET: Server status
      - get:
          url: "/api/status"
          expect:
            - statusCode: 200
              timeout: 2000

      # GET: Database connection check
      - get:
          url: "{{ baseUrl }}/health/db"
          expect:
            - statusCode: 200
              timeout: 3000

# ============================================================================
# CONFIGURACIÓN DE REPORTE
# ============================================================================

processor: "load-test-processor.js"  # Procesador personalizado para logging

output:
  - type: "statsd"
    host: "localhost"
    port: 8125
    prefix: "bge_load_test"